# Exercise 1: Getting & Knowing Your Data (Chipo)

### Start by importing the necessary libraries.

In [1]:
import pandas as pd
import numpy as np
import random

### Retrieve the dataset from this link and assign it to a variable ‘chipo’. Display the first 10 rows of ‘chipo’ using the head() function.

In [2]:
data = pd.read_csv('chipo.tsv', sep='\t')
data.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

### Determine the total number of entries (rows) in ‘chipo’ using shape or info().

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

### Use shape or columns to find the total number of columns in ‘chipo’.

In [4]:
data.shape

(4622, 5)

### Use columns to print all the column names.

In [5]:
data.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

### Utilize index to understand how the DataFrame is indexed.

In [6]:
data.index

RangeIndex(start=0, stop=4622, step=1)

### Use the value_counts() method on the ‘item_name’ column to find the most ordered item.

In [7]:
most_ordered_item = data['item_name'].value_counts()
most_ordered_item

item_name
Chicken Bowl                             726
Chicken Burrito                          553
Chips and Guacamole                      479
Steak Burrito                            368
Canned Soft Drink                        301
Steak Bowl                               211
Chips                                    211
Bottled Water                            162
Chicken Soft Tacos                       115
Chips and Fresh Tomato Salsa             110
Chicken Salad Bowl                       110
Canned Soda                              104
Side of Chips                            101
Veggie Burrito                            95
Barbacoa Burrito                          91
Veggie Bowl                               85
Carnitas Bowl                             68
Barbacoa Bowl                             66
Carnitas Burrito                          59
Steak Soft Tacos                          55
6 Pack Soft Drink                         54
Chips and Tomatillo Red Chili Salsa       48
Chicken Crispy Tacos                      47
Chips and Tomatillo Green Chili Salsa     43
Carnitas Soft Tacos                       40
Steak Crispy Tacos                        35
Chips and Tomatillo-Green Chili Salsa     31
Steak Salad Bowl                          29
Nantucket Nectar                          27
Barbacoa Soft Tacos                       25
Chips and Roasted Chili Corn Salsa        22
Izze                                      20
Chips and Tomatillo-Red Chili Salsa       20
Veggie Salad Bowl                         18
Chips and Roasted Chili-Corn Salsa        18
Barbacoa Crispy Tacos                     11
Barbacoa Salad Bowl                       10
Chicken Salad                              9
Veggie Soft Tacos                          7
Carnitas Crispy Tacos                      7
Veggie Salad                               6
Carnitas Salad Bowl                        6
Burrito                                    6
Steak Salad                                4
Crispy Tacos                               2
Salad                                      2
Bowl                                       2
Chips and Mild Fresh Tomato Salsa          1
Veggie Crispy Tacos                        1
Carnitas Salad                             1
Name: count, dtype: int64



### Find the total number of items ordered by summing the ‘quantity’ column.

In [8]:
total_items_ordered = data['quantity'].sum()
total_items_ordered

4972

### Use value_counts() on ‘choice_description’ to find the most ordered item from this column.

In [9]:
choice_description_counts = data['choice_description'].value_counts()
choice_description_counts.head(1)

choice_description
[Diet Coke]    134
Name: count, dtype: int64

### Convert ‘item_price’ to a float datatype using apply() and lambda. (Hint: You’ll need to remove the ‘$’ from the prices first)

In [10]:
data['item_price'] = data['item_price'].astype(str)
data['item_price'] = data['item_price'].str.replace('$', '')
data['item_price'].head()

0     2.39
1     3.39
2     3.39
3     2.39
4    16.98
Name: item_price, dtype: object

### Calculate the total revenue for the dataset by summing the ‘item_price’ column.

In [11]:
data['item_price'] = data['item_price'].astype(float)
total_revenue = data['item_price'].sum()
print(f"The total revenue is: {total_revenue:.0f}$")

The total revenue is: 34500$

### Find the total number of orders by using the nunique() function on the ‘order_id’ column.

In [12]:
Total_Number_Of_Orders = data['order_id'].nunique()
Total_Number_Of_Orders

1834

### Compute the average order value by dividing the total revenue by the number of orders.

In [13]:
Average_Order_Value = total_revenue / Total_Number_Of_Orders
Average_Order_Value

18.811428571428575

### Determine the total number of unique items sold using the nunique() function on the ‘item_name’ column.

In [14]:
total_number_of_unique_items_sold = data['item_name'].nunique()
total_number_of_unique_items_sold

50

# Exercise 2: Filtering & Sorting (Chipo)

### Use the already created dataframe ‘chipo’ from the previous section. Using conditional selection, find the count of products that cost more than $10. Note: the price is listed in the ‘item_price’ column.

In [15]:
products_over_10 = data[data['item_price'] > 10]
products_over_10.shape[0]
# or just
products_over_10.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1130 entries, 4 to 4619
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            1130 non-null   int64
 1   quantity            1130 non-null   int64
 2   item_name           1130 non-null   object
 3   choice_description  1123 non-null   object
 4   item_price          1130 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 53.0+ KB

# Exercise 3: Grouping (Users)

### Get the dataset from this link and assign it to ‘users’.

In [16]:
users = pd.read_csv('u.user.txt', sep='|')
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Use the groupby() function to find the mean age per occupation.

In [17]:
mean_age_per_occupation = users.groupby('occupation')['age'].mean()
mean_age_per_occupation

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

 #  Exercise 4: Merge (All_data, All_data_col, Data3)

### Create three DataFrames with the following suggested structure. Feel free to populate them with your own data:

##### ‘data1’: Columns could be ‘ID’ (integer values) and ‘Name’ (string values)
##### ‘data2’: Columns could be ‘ID’ (integer values) and ‘Name’ (string values)
##### ‘data3’: Columns could be ‘ID’ (integer values) and ‘Score’ (integer values between 0-100)

In [18]:
data1 = pd.DataFrame({
    'ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve']
})

data1

    ID     Name
0  101    Alice
1  102      Bob
2  103  Charlie
3  104    David
4  105      Eve

In [19]:
data2 = pd.DataFrame({
    'ID': [201, 202, 203, 204, 205],
    'Name': ['Frank', 'Grace', 'Hannah', 'Ivy', 'Jack']
})

data2

    ID    Name
0  201   Frank
1  202   Grace
2  203  Hannah
3  204     Ivy
4  205    Jack

In [20]:
data3 = pd.DataFrame({
    'ID': [301, 302, 303, 304, 305],
    'Score': [random.randint(0, 100) for _ in range(5)]
})

data3

    ID  Score
0  301     24
1  302     46
2  303     82
3  304     46
4  305     61

### Merge the two dataframes ‘data1’ and ‘data2’ along rows using the concat() function and assign it to ‘all_data’.

In [21]:
all_data = pd.concat([data1, data2], ignore_index=True)
print(all_data)

    ID     Name
0  101    Alice
1  102      Bob
2  103  Charlie
3  104    David
4  105      Eve
5  201    Frank
6  202    Grace
7  203   Hannah
8  204      Ivy
9  205     Jack

### Merge ‘data1’ and ‘data2’ along columns using concat() and assign it to ‘all_data_col’.

In [22]:
all_data_col = pd.concat([data1, data2], axis=1)
print(all_data_col)

    ID     Name   ID    Name
0  101    Alice  201   Frank
1  102      Bob  202   Grace
2  103  Charlie  203  Hannah
3  104    David  204     Ivy
4  105      Eve  205    Jack

# Exercise 5: Deleting (Iris)

### Retrieve the dataset from this link and assign it to ‘iris’.

In [23]:
iris = pd.read_csv('iris.data.txt')
iris.head()

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

### Assign appropriate column names to the DataFrame, such as ‘sepal_length’, ‘sepal_width’, ‘petal_length’, ‘petal_width’, and ‘species’.

In [24]:
iris.columns = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']
iris

     sepal_length  sepal_width  petal_length  petal_width         species
0             4.9          3.0           1.4          0.2     Iris-setosa
1             4.7          3.2           1.3          0.2     Iris-setosa
2             4.6          3.1           1.5          0.2     Iris-setosa
3             5.0          3.6           1.4          0.2     Iris-setosa
4             5.4          3.9           1.7          0.4     Iris-setosa
..            ...          ...           ...          ...             ...
144           6.7          3.0           5.2          2.3  Iris-virginica
145           6.3          2.5           5.0          1.9  Iris-virginica
146           6.5          3.0           5.2          2.0  Iris-virginica
147           6.2          3.4           5.4          2.3  Iris-virginica
148           5.9          3.0           5.1          1.8  Iris-virginica

[149 rows x 5 columns]

### Check if there are any missing values in ‘iris’ using the isnull() function

In [25]:
iris.isnull().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

# Exercise 6: Creating Series And DataFrames (Pokemon)

### Create a data dictionary with the following structure, then convert it into a DataFrame and name it ‘pokemon’:

In [26]:
pokemon = {'evolution': ['Ivysaur', 'Charmeleon', 'Wartortle', 'Metapod'],
'hp': [45, 39, 44, 45],
'name': ['Bulbasaur', 'Charmander', 'Squirtle', 'Caterpie'],
'pokedex': ['yes', 'no', 'yes', 'no'],
'type': ['grass', 'fire', 'water', 'bug']}

pokemon = pd.DataFrame(pokemon)
pokemon

    evolution  hp        name pokedex   type
0     Ivysaur  45   Bulbasaur     yes  grass
1  Charmeleon  39  Charmander      no   fire
2   Wartortle  44    Squirtle     yes  water
3     Metapod  45    Caterpie      no    bug

### Rearrange the columns in the order: ‘name’, ‘type’, ‘hp’, ‘evolution’, ‘pokedex’ using simple DataFrame indexing.

In [27]:
pokemon = pokemon[['name', 'type', 'hp', 'evolution', 'pokedex']]
pokemon

         name   type  hp   evolution pokedex
0   Bulbasaur  grass  45     Ivysaur     yes
1  Charmander   fire  39  Charmeleon      no
2    Squirtle  water  44   Wartortle     yes
3    Caterpie    bug  45     Metapod      no

# Exercise 7: Descriptive Statistics (Baby_names)

### Download and load the US Baby Names data into a DataFrame named baby_names.

In [28]:
baby_names = pd.read_csv('US_Baby_Names_right.csv')
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### Display the first 10 entries using the head method.

In [29]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns ‘Unnamed: 0’ and ‘Id’ using the drop method.

In [30]:
baby_names.drop(['Unnamed: 0', 'Id'], axis=1, inplace=True)
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 5 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   Name    1016395 non-null  object
 1   Year    1016395 non-null  int64
 2   Gender  1016395 non-null  object
 3   State   1016395 non-null  object
 4   Count   1016395 non-null  int64
dtypes: int64(2), object(3)
memory usage: 38.8+ MB

# Exercise 8: Handling Time Series Data (Investor_data)
### Create your own dataset using the pd.date_range function. Assume the dataset has the following columns: [‘Date’, ‘Temperature’, ‘Humidity’, ‘Wind_Speed’]. You can use the following code to create the data points for Temperature, Humidity and Wind_Speed columns:

In [31]:
temperature = [30, 31, 29, 32, 33, 34, 28, 27, 25, 35]
humidity = [80, 75, 70, 85, 90, 80, 75, 60, 65, 70]
wind_speed = [5, 6, 7, 8, 9, 4, 10, 5, 6, 7]

### Create the Date column here (with dates between 2021-01-01 and 2021-01-10, Day frequency)

In [32]:
date_rng = pd.date_range(start='2023-01-01', end='2023-01-10', freq='D')

### Create a dataframe with all of the columns inside

In [33]:
data = {
    'Date': date_rng,
    'Temperature': temperature,
    'Humidity': humidity,
    'Wind_Speed': wind_speed
}

weather_data = pd.DataFrame(data)
weather_data

        Date  Temperature  Humidity  Wind_Speed
0 2023-01-01           30        80           5
1 2023-01-02           31        75           6
2 2023-01-03           29        70           7
3 2023-01-04           32        85           8
4 2023-01-05           33        90           9
5 2023-01-06           34        80           4
6 2023-01-07           28        75          10
7 2023-01-08           27        60           5
8 2023-01-09           25        65           6
9 2023-01-10           35        70           7

### Determine the frequency of the dataset.
##### Frequency refers to the regularity with which the data points are recorded, e.g., daily, weekly, etc. Use pd.infer_freq() to infer the frequency of your DataFrame’s ‘Date’ column.
##### The output should look like this: The frequency of the dataset is D.

In [34]:
frequency = pd.infer_freq(weather_data['Date'])
frequency

'D'

### Set ‘Date’ as the index of the DataFrame.
##### Hint: You can use the set_index method to set ‘Date’ as the index of the DataFrame. Use the inplace=True parameter to modify the DataFrame in place.

In [35]:
weather_data.set_index('Date', inplace=True)
weather_data

            Temperature  Humidity  Wind_Speed
Date
2023-01-01           30        80           5
2023-01-02           31        75           6
2023-01-03           29        70           7
2023-01-04           32        85           8
2023-01-05           33        90           9
2023-01-06           34        80           4
2023-01-07           28        75          10
2023-01-08           27        60           5
2023-01-09           25        65           6
2023-01-10           35        70           7